export const scaleFactor = 4;

export const dialogueData_new = {
  // pc: `私のPCがある。最近は主にPythonとJavaScriptを使った開発を行っています。`,
  // "cs-degree1": `私は現在、東京理科大学の情報計算科学科に所属しています。`,
  // "cs-degree2": `私はPython、Java、Go、C、C++、C#、Flutter、JavaScript、TypeScriptなどのプログラミング言語を習得しています。また、UnityやBlenderなどにも取り組んでいます。`,
  "sofa": `私のソファがあります。ここでリラックスしてYouTubeを観ることが好きです。`,
  "shelf": `私の棚があります。服がたくさん収納されています。`,
  //tv: `私のテレビがあります。このテレビを使ってドラマやアニメを見ています。`,
  //bed: `私のベッドがあります。ふかふかでお気に入りです。`,
  resume: `私の名前は服部航大です。これは私の<a href="https://github.com/hato72" target="_blank">GitHub</a>アカウントです。ぜひチェックしてください。`,
  projects: `私の<a href="https://github.com/hato72" target="_blank">ポートフォリオサイト</a>をご紹介します。私の経験やプログラミング開発物などを記載しています。`,
  box: `このboxは鍵なしでは開けられません。この室内のどこかにある鍵を探してみてください。地下に降りると見つかるかもしれません。`,
  //door: `この<a href="https://hato72.github.io/portfolio/" target="_blank">ドア</a>をクリックすると、私の過去の経験について詳細を学ぶことができます。興味がある方はぜひチェックしてください。`,
  ladder: `下の部屋に降りる場合は、"Move"ボタンをクリックしてください。`,
  library: `私の棚があります。プログラミングや数学、英語、IT関連,IT資格本など様々な参考書が並べられています。`,
  door: `このページを離れたい場合は、タブを閉じてください。
    こちらにおいで下さり、ありがとうございました。またいつでもいらっしゃってください。`,
};

export const dialogueData_next_new = {
  //pc: `私のPCがある。最近は主にPythonとJavaScriptを使った開発を行っています。`,
  //"cs-degree1": `私は現在、東京理科大学の情報計算科学科に所属しています。`,
  //"cs-degree2": `私はPython、Java、Go、C、C++、C#、Flutter、JavaScript、TypeScriptなどのプログラミング言語を習得しています。また、UnityやBlenderなどにも取り組んでいます。`,
  "sofa": `私のソファがあります。ここでリラックスしてYouTubeを観ることが好きです。`,
  "shelf": `私の棚があります。服がたくさん収納されています。`,
  //tv: `私のテレビがあります。このテレビを使ってドラマやアニメを見ています。`,
  //bed: `私のベッドがあります。ふかふかでお気に入りです。`,
  resume: `私の名前は服部航大です。これは私の<a href="https://github.com/hato72" target="_blank">GitHub</a>アカウントです。ぜひチェックしてください。`,
  projects: `私の<a href="https://github.com/hato72" target="_blank">ポートフォリオサイト</a>をご紹介します。私の経験やプログラミング開発物などを記載しています。`,
  box: `鍵を開けてくださりありがとうございます。ここでは私の3つの趣味についてお話ししたいと思います。
  1つ目はベースを弾くことです。大学2年生の時にベースを始め、好きな曲を練習して楽しんでいます。
  特に「ヨルシカ」というバンドの曲を演奏することが好きです。
  2つ目はゲームをすることです。私は小学校2年生の頃からゲームが大好きで、特にお気に入りのゲームはスプラトゥーンシリーズとポケモンシリーズです。
  スプラトゥーンシリーズは3つのタイトルで合計6,000時間以上、ポケモンシリーズは4つのタイトルで合計4,000時間以上プレイしています。
  3つ目はプログラミングです。大学入学を機にプログラミングを始めて以降、毎日プログラミングを行っており、休日は10時間以上行っているときもあります。
  最近は様々な言語を使った開発も行えるようになり、日々アイデアを探して開発を行っています。`,
  //door: `この<a href="https://hato72.github.io/portfolio/" target="_blank">ドア</a>をクリックすると、私の過去の経験について詳細を学ぶことができます。興味がある方はぜひチェックしてください。`,
  ladder: `地下室に降りるには、"Move"ボタンをクリックしてください。`,
  library: `私の棚があります。プログラミングや数学、英語、IT関連,IT資格本など様々な参考書が並べられています。`,
  door: `このページを離れたい場合は、タブを閉じてください。
    こちらにおいで下さり、ありがとうございました。またいつでもいらっしゃってください。`,
};